# LoadAttrForceArrowType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadAttrForceArrowType Property
ParameterTypeId Class See Also
---
"Force arrowhead"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadAttrForceArrowType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadAttrForceArrowType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadAttrForceArrowType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace